Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/assistance_in_illness.html.txt.tmx
Source language: en
Languages: ga

source: Whether you need hospital treatment, are disabled or care for someone who is incapacitated, you will find information here on health care and income supports
ga: Má tá cúram oispidéil uait, nó má tá tú faoi mhíchumas, nó má tá tú i gcúram ar dhuine atá ar éagumas, gheobhaidh tú eolas ar chúram leighis

source: You can find out about your eligibility for health services as well as your eligibility for a medical card
ga: Is féidir leat eolas a fháil faoi do theidlíocht do sheirbhísí sláinte chomh maith le do theidlíocht do chárta leighis

source: In addition, your can find information on hospital services, mental health services and community care services
ga: Chomh maith, d’fhéadfá eolas a aimsiú faoi sheirbhísí ospidéil, seirbhísí sláinte meabhrach agus seirbhísí cúram pobail

source: Health schemes and benefits
ga: Scéimeanna sláinte agus sochair

source: Information is available on the a range of assistance including the Drugs Payment Scheme, Long Term Illness Scheme, Injury Benefit and the Treatment Benefit Scheme
ga: Tá eolas ar fáil faoi réimse sochar a áiríonn an Scéim Íocaíochta Drugaí, Scéim Tinneas Fadtéarmach, Sochar Díobhála agus an Scéim um Sochar Coireala

source: Benefits for people with disabilities
ga: Sochair do dhaoine le míchumas

source: If you have a disability, you can find out about your entitlements including Disability Allowance, Illness Benefit, Disablement Benefit, Invalidity Pension and Blind Pension
ga: Má tá míchumas agat, is féidir leat eolas a fháil faoi do theidlíochtaí, san áireamh LiúntasMíchumais, Sochar Breoiteachta, Sochar Míthreorach, Pinsean Easlaínte agus Pinsean na nDall

source: If you are caring for someone who is incapacitated, you can find out about your entitlements to Carer's Allowance, Carer's Benefit, and Domiciliary Care Allowance
ga: Má tá tú ag tabhairt aire do dhuine faoi mhíchumas, d’fhéadfá eolas a aimsiú faoi do theidlíocht do Liúntas Cúramóra, Sochar Cúramóra agus Liúntas Cúram Baile

source: There are a number of allowances and reliefs for people who have medical expenses or who have a disability
ga: Tá faoisimh agus liúntais chánach ar fail do dhaoine a íocann costais leighis nó a bhfuil faoi mhíchumas
